shared_with_qemu/pi_fio_results/iomap_4G_mem_read_bs-1M_20250814-194909.log
buffered-read: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=2937: Thu Aug 14 19:49:11 2025
  read: IOPS=402, BW=402MiB/s (422MB/s)(512MiB/1273msec)
    clat (usec): min=186, max=3170, avg=2484.28, stdev=279.41
     lat (usec): min=186, max=3171, avg=2484.41, stdev=279.40
    clat percentiles (usec):
     |  1.00th=[  314],  5.00th=[ 2376], 10.00th=[ 2507], 20.00th=[ 2507],
     | 30.00th=[ 2507], 40.00th=[ 2507], 50.00th=[ 2507], 60.00th=[ 2507],
     | 70.00th=[ 2507], 80.00th=[ 2507], 90.00th=[ 2507], 95.00th=[ 2638],
     | 99.00th=[ 2868], 99.50th=[ 2966], 99.90th=[ 3163], 99.95th=[ 3163],
     | 99.99th=[ 3163]
   bw (  KiB/s): min=407552, max=417792, per=100.00%, avg=412672.00, stdev=7240.77, samples=2
   iops        : min=  398, max=  408, avg=403.00, stdev= 7.07, samples=2
  lat (usec)   : 250=0.98%, 500=0.20%, 750=0.20%
  lat (msec)   : 2=0.20%, 4=98.44%
  cpu          : usr=0.00%, sys=7.31%, ctx=2031, majf=0, minf=70
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=512,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=402MiB/s (422MB/s), 402MiB/s-402MiB/s (422MB/s-422MB/s), io=512MiB (537MB), run=1273-1273msec

Disk stats (read/write):
  nvme0n1: ios=3660/0, merge=86/0, ticks=3894/0, in_queue=3894, util=85.90%