shared_with_qemu/pi_fio_results/iomap_4G_mem_write_bs-4k_20250814-195649.log
buffered-write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=34058: Thu Aug 14 19:56:50 2025
  write: IOPS=187k, BW=730MiB/s (766MB/s)(512MiB/701msec); 0 zone resets
    clat (nsec): min=3371, max=115056, avg=4842.07, stdev=998.72
     lat (usec): min=3, max=115, avg= 4.93, stdev= 1.00
    clat percentiles (nsec):
     |  1.00th=[ 3952],  5.00th=[ 4192], 10.00th=[ 4320], 20.00th=[ 4448],
     | 30.00th=[ 4576], 40.00th=[ 4704], 50.00th=[ 4768], 60.00th=[ 4896],
     | 70.00th=[ 4960], 80.00th=[ 5088], 90.00th=[ 5280], 95.00th=[ 5472],
     | 99.00th=[ 6496], 99.50th=[ 7328], 99.90th=[17280], 99.95th=[21120],
     | 99.99th=[33536]
   bw (  KiB/s): min=743531, max=743531, per=99.41%, avg=743531.00, stdev= 0.00, samples=1
   iops        : min=185882, max=185882, avg=185882.00, stdev= 0.00, samples=1
  lat (usec)   : 4=1.41%, 10=98.41%, 20=0.12%, 50=0.05%, 100=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=15.86%, sys=83.43%, ctx=20, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=730MiB/s (766MB/s), 730MiB/s-730MiB/s (766MB/s-766MB/s), io=512MiB (537MB), run=701-701msec

Disk stats (read/write):
  nvme0n1: ios=0/13895, merge=0/191, ticks=0/10664, in_queue=10713, util=40.90%