shared_with_qemu/pi_fio_results/iomap_com_4G_mem_read_bs-128k_20250815-070729.log
buffered-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=3416: Fri Aug 15 07:07:31 2025
  read: IOPS=3177, BW=397MiB/s (417MB/s)(512MiB/1289msec)
    clat (usec): min=24, max=659, avg=313.85, stdev=118.64
     lat (usec): min=24, max=660, avg=313.94, stdev=118.64
    clat percentiles (usec):
     |  1.00th=[   77],  5.00th=[   79], 10.00th=[  119], 20.00th=[  314],
     | 30.00th=[  314], 40.00th=[  314], 50.00th=[  314], 60.00th=[  314],
     | 70.00th=[  314], 80.00th=[  314], 90.00th=[  498], 95.00th=[  545],
     | 99.00th=[  553], 99.50th=[  553], 99.90th=[  562], 99.95th=[  586],
     | 99.99th=[  660]
   bw (  KiB/s): min=406528, max=407040, per=100.00%, avg=406784.00, stdev=362.04, samples=2
   iops        : min= 3176, max= 3180, avg=3178.00, stdev= 2.83, samples=2
  lat (usec)   : 50=0.02%, 100=9.16%, 250=8.52%, 500=72.34%, 750=9.96%
  cpu          : usr=0.54%, sys=7.22%, ctx=4104, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4096,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=397MiB/s (417MB/s), 397MiB/s-397MiB/s (417MB/s-417MB/s), io=512MiB (537MB), run=1289-1289msec

Disk stats (read/write):
  nvme0n1: ios=3671/0, merge=89/0, ticks=2218/0, in_queue=2218, util=84.62%