shared_with_qemu/pi_fio_results/iomap_com_4G_mem_write_bs-100M_20250815-073824.log
buffered-write: (g=0): rw=write, bs=(R) 100MiB-100MiB, (W) 100MiB-100MiB, (T) 100MiB-100MiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=16111: Fri Aug 15 07:38:24 2025
  write: IOPS=23, BW=2304MiB/s (2416MB/s)(500MiB/217msec); 0 zone resets
    clat (usec): min=29376, max=31197, avg=29931.48, stdev=753.52
     lat (usec): min=37157, max=46953, avg=43208.62, stdev=3709.90
    clat percentiles (usec):
     |  1.00th=[29492],  5.00th=[29492], 10.00th=[29492], 20.00th=[29492],
     | 30.00th=[29492], 40.00th=[29492], 50.00th=[29754], 60.00th=[29754],
     | 70.00th=[30016], 80.00th=[30016], 90.00th=[31327], 95.00th=[31327],
     | 99.00th=[31327], 99.50th=[31327], 99.90th=[31327], 99.95th=[31327],
     | 99.99th=[31327]
  lat (msec)   : 50=100.00%
  cpu          : usr=18.98%, sys=59.72%, ctx=381, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,5,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2304MiB/s (2416MB/s), 2304MiB/s-2304MiB/s (2416MB/s-2416MB/s), io=500MiB (524MB), run=217-217msec

Disk stats (read/write):
  nvme0n1: ios=0/860, merge=0/21, ticks=0/354, in_queue=358, util=14.46%