shared_with_qemu/pi_fio_results/iomap_com_4G_mem_write_bs-1M_20250815-073817.log
buffered-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=8564: Fri Aug 15 07:38:17 2025
  write: IOPS=6320, BW=6321MiB/s (6628MB/s)(512MiB/81msec); 0 zone resets
    clat (usec): min=108, max=264, avg=142.96, stdev=21.02
     lat (usec): min=120, max=278, avg=155.82, stdev=21.46
    clat percentiles (usec):
     |  1.00th=[  116],  5.00th=[  123], 10.00th=[  127], 20.00th=[  130],
     | 30.00th=[  133], 40.00th=[  135], 50.00th=[  137], 60.00th=[  139],
     | 70.00th=[  147], 80.00th=[  155], 90.00th=[  167], 95.00th=[  186],
     | 99.00th=[  225], 99.50th=[  251], 99.90th=[  265], 99.95th=[  265],
     | 99.99th=[  265]
  lat (usec)   : 250=99.41%, 500=0.59%
  cpu          : usr=13.75%, sys=78.75%, ctx=50, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,512,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=6321MiB/s (6628MB/s), 6321MiB/s-6321MiB/s (6628MB/s-6628MB/s), io=512MiB (537MB), run=81-81msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%