shared_with_qemu/pi_fio_results/iomap_hole_4G_mem_read_bs-100M_20250814-195219.log
buffered-read: (g=0): rw=read, bs=(R) 100MiB-100MiB, (W) 100MiB-100MiB, (T) 100MiB-100MiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=4584: Thu Aug 14 19:52:20 2025
  read: IOPS=11, BW=1134MiB/s (1189MB/s)(600MiB/529msec)
    clat (usec): min=85010, max=95556, avg=88049.81, stdev=4223.35
     lat (usec): min=85011, max=95556, avg=88050.50, stdev=4223.30
    clat percentiles (usec):
     |  1.00th=[85459],  5.00th=[85459], 10.00th=[85459], 20.00th=[85459],
     | 30.00th=[85459], 40.00th=[85459], 50.00th=[85459], 60.00th=[85459],
     | 70.00th=[90702], 80.00th=[90702], 90.00th=[95945], 95.00th=[95945],
     | 99.00th=[95945], 99.50th=[95945], 99.90th=[95945], 99.95th=[95945],
     | 99.99th=[95945]
   bw (  KiB/s): min=1021956, max=1021956, per=87.99%, avg=1021956.00, stdev= 0.00, samples=1
   iops        : min=    9, max=    9, avg= 9.00, stdev= 0.00, samples=1
  lat (msec)   : 100=100.00%
  cpu          : usr=0.00%, sys=99.05%, ctx=27, majf=0, minf=2312
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1134MiB/s (1189MB/s), 1134MiB/s-1134MiB/s (1189MB/s-1189MB/s), io=600MiB (629MB), run=529-529msec

Disk stats (read/write):
  nvme0n1: ios=11/0, merge=0/0, ticks=2/0, in_queue=1, util=0.00%