shared_with_qemu/pi_fio_results/iomap_hole_4G_mem_read_bs-100M_20250814-195221.log
buffered-read: (g=0): rw=read, bs=(R) 100MiB-100MiB, (W) 100MiB-100MiB, (T) 100MiB-100MiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=4624: Thu Aug 14 19:52:22 2025
  read: IOPS=11, BW=1121MiB/s (1176MB/s)(600MiB/535msec)
    clat (usec): min=87601, max=91959, avg=89042.32, stdev=1993.57
     lat (usec): min=87601, max=91959, avg=89043.19, stdev=1993.59
    clat percentiles (usec):
     |  1.00th=[87557],  5.00th=[87557], 10.00th=[87557], 20.00th=[87557],
     | 30.00th=[87557], 40.00th=[87557], 50.00th=[87557], 60.00th=[88605],
     | 70.00th=[90702], 80.00th=[90702], 90.00th=[91751], 95.00th=[91751],
     | 99.00th=[91751], 99.50th=[91751], 99.90th=[91751], 99.95th=[91751],
     | 99.99th=[91751]
   bw (  KiB/s): min=1024000, max=1024000, per=89.17%, avg=1024000.00, stdev= 0.00, samples=1
   iops        : min=   10, max=   10, avg=10.00, stdev= 0.00, samples=1
  lat (msec)   : 100=100.00%
  cpu          : usr=0.00%, sys=99.63%, ctx=27, majf=0, minf=2312
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1121MiB/s (1176MB/s), 1121MiB/s-1121MiB/s (1176MB/s-1176MB/s), io=600MiB (629MB), run=535-535msec

Disk stats (read/write):
  nvme0n1: ios=9/0, merge=0/0, ticks=1/0, in_queue=2, util=0.00%