shared_with_qemu/pi_fio_results/iomap_hole_cold_4G_mem_write_bs-1M_20250814-195840.log
buffered-write: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
fio-3.33
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=40980: Thu Aug 14 19:58:40 2025
  write: IOPS=5389, BW=5389MiB/s (5651MB/s)(512MiB/95msec); 0 zone resets
    clat (usec): min=131, max=454, avg=165.77, stdev=29.15
     lat (usec): min=142, max=496, avg=179.84, stdev=30.63
    clat percentiles (usec):
     |  1.00th=[  133],  5.00th=[  137], 10.00th=[  139], 20.00th=[  143],
     | 30.00th=[  147], 40.00th=[  157], 50.00th=[  163], 60.00th=[  167],
     | 70.00th=[  174], 80.00th=[  180], 90.00th=[  198], 95.00th=[  212],
     | 99.00th=[  255], 99.50th=[  273], 99.90th=[  457], 99.95th=[  457],
     | 99.99th=[  457]
  lat (usec)   : 250=98.83%, 500=1.17%
  cpu          : usr=11.70%, sys=87.23%, ctx=5, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,512,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=5389MiB/s (5651MB/s), 5389MiB/s-5389MiB/s (5651MB/s-5651MB/s), io=512MiB (537MB), run=95-95msec

Disk stats (read/write):
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%